#+BEGIN_SRC python :session :results output
import org.python.util.PythonInterpreter as PythonInterpreter
execfile("/home/idv/work/classPathLoader.py")
cpl = classPathLoader()
foo = cpl.loadResource("ucar/unidata/idv/resources/python/shell.py")

pi.execfile(foo)
foo = cpl.loadResource("ucar/unidata/idv/resources/python/isl.py")
pi.execfile(foo)
#+END_SRC

#+RESULTS:
: Jython 2.7.0 (default:9987c746f838, Apr 29 2015, 02:25:11) 
: [Java HotSpot(TM) 64-Bit Server VM (Oracle Corporation)] on java1.7.0_51
: Type "help", "copyright", "credits" or "license" for more information.

#+BEGIN_SRC python :session :results output
import java.util.List
from java.awt import *
import ucar.unidata.idv.DefaultIdv as DefaultIdv
import ucar.unidata.idv.ui.ImageGenerator as ImageGenerator
idv = DefaultIdv([])
islInterpreter = ImageGenerator(idv)
#execfile("/home/idv/work/shell.py")
#execfile("/home/idv/work/isl.py")
#print type(idv)
#+END_SRC

#+BEGIN_SRC python :session :results output 
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session :output none
setOffScreen(1)
idv.getStateManager().setViewSize(java.awt.Dimension(800,600))
ds = makeDataSource("dods://thredds.ucar.edu/thredds/dodsC/grib/NCEP/NAM/CONUS_80km/NAM_CONUS_80km_20150528_0000.grib1")
temp = getData(ds.getName(),"T")
dc = createDisplay('planviewcolor',temp)
pause()
image = getImage()
writeImage('/home/idv/work/image.png')
#+END_SRC

#+RESULTS:

